// Генерація великого масиву новин для тестування FlatList
export const NEWS_DATA = Array.from({ length: 50 }).map((_, index) => ({
  id: index.toString(),
  title: `Новина про ІТ-технології #${index + 1}`,
  description: 'Це детальний опис новини, який розкриває суть події. Тут може бути багато тексту для тестування прокрутки.',
  image: `https://picsum.photos/seed/${index + 1}/400/200` // Генерація випадкових картинок
}));

// Дані для SectionList (Контакти)
export const CONTACTS_DATA = [
  {
    title: "Викладачі",
    data: ["Іванов І.І.", "Петров П.П.", "Сидоров С.С."]
  },
  {
    title: "Студенти (IPZ-24-1)",
    data: ["Бучинський Д.П.", "Коваленко О.О.", "Шевченко М.М."]
  },
  {
    title: "Деканат",
    data: ["Секретар", "Заступник декана", "Методист"]
  }
];